In [1]:
import pandas as pd

import California

In [5]:
cali_1=pd.read_csv("D:/3.2/Business Analytics/air/all years/cali-contra costa.csv")
cali_2=pd.read_csv("D:/3.2/Business Analytics/air/all years/cali-el dorado.csv")
cali_3=pd.read_csv("D:/3.2/Business Analytics/air/all years/cali-imperial.csv")
cali_4=pd.read_csv("D:/3.2/Business Analytics/air/all years/cali-mariposa.csv")
cali_5=pd.read_csv("D:/3.2/Business Analytics/air/all years/cali-placer.csv")
cali_6=pd.read_csv("D:/3.2/Business Analytics/air/all years/cali-san diego.csv")
cali_7=pd.read_csv("D:/3.2/Business Analytics/air/all years/cali-san fran.csv")

import Florida

In [9]:
fl_1=pd.read_csv("D:/3.2/Business Analytics/air/all years/fl-bay.csv")
fl_2=pd.read_csv("D:/3.2/Business Analytics/air/all years/fl-broward.csv")
fl_3=pd.read_csv("D:/3.2/Business Analytics/air/all years/fl-duval.csv")
fl_4=pd.read_csv("D:/3.2/Business Analytics/air/all years/fl-leon.csv")
fl_5=pd.read_csv("D:/3.2/Business Analytics/air/all years/fl-miami-dade.csv")

import North Dakota

In [18]:
nd_1=pd.read_csv("D:/3.2/Business Analytics/air/all years/nd-billings.csv")
nd_2=pd.read_csv("D:/3.2/Business Analytics/air/all years/nd-cass.csv")
nd_3=pd.read_csv("D:/3.2/Business Analytics/air/all years/nd-mercer.csv")

import New York

In [19]:
ny_1=pd.read_csv("D:/3.2/Business Analytics/air/all years/ny-bronx.csv")
ny_2=pd.read_csv("D:/3.2/Business Analytics/air/all years/ny-chautauqua.csv")
ny_3=pd.read_csv("D:/3.2/Business Analytics/air/all years/ny-queens.csv")
ny_4=pd.read_csv("D:/3.2/Business Analytics/air/all years/ny-suffolk.csv")
ny_5=pd.read_csv("D:/3.2/Business Analytics/air/all years/ny-westchester.csv")

import Ohio

In [20]:
oh_1=pd.read_csv("D:/3.2/Business Analytics/air/all years/oh-butler.csv")
oh_2=pd.read_csv("D:/3.2/Business Analytics/air/all years/oh-cuyahoga.csv")
oh_3=pd.read_csv("D:/3.2/Business Analytics/air/all years/oh-franklin.csv")
oh_4=pd.read_csv("D:/3.2/Business Analytics/air/all years/oh-hamilton.csv")

import Oklahoma

In [21]:
ok_1=pd.read_csv("D:/3.2/Business Analytics/air/all years/ok-cleveland.csv")
ok_2=pd.read_csv("D:/3.2/Business Analytics/air/all years/ok-comanche.csv")
ok_3=pd.read_csv("D:/3.2/Business Analytics/air/all years/ok-pittsburg.csv")

import Pennsylvania

In [22]:
penn_1=pd.read_csv("D:/3.2/Business Analytics/air/all years/penn-centre.csv")
penn_2=pd.read_csv("D:/3.2/Business Analytics/air/all years/penn-dauphin.csv")
penn_3=pd.read_csv("D:/3.2/Business Analytics/air/all years/penn-northampton.csv")
penn_4=pd.read_csv("D:/3.2/Business Analytics/air/all years/penn-philadelphia.csv")
penn_5=pd.read_csv("D:/3.2/Business Analytics/air/all years/penn-washington.csv")
penn_6=pd.read_csv("D:/3.2/Business Analytics/air/all years/penn-york.csv")

import Texas

In [23]:
tx_1=pd.read_csv("D:/3.2/Business Analytics/air/all years/tx-brazoria.csv")
tx_2=pd.read_csv("D:/3.2/Business Analytics/air/all years/tx-cameron.csv")
tx_3=pd.read_csv("D:/3.2/Business Analytics/air/all years/tx-dallas.csv")
tx_4=pd.read_csv("D:/3.2/Business Analytics/air/all years/tx-galveston.csv")
tx_5=pd.read_csv("D:/3.2/Business Analytics/air/all years/tx-nueces.csv")
tx_6=pd.read_csv("D:/3.2/Business Analytics/air/all years/tx-travis.csv")

import West Virginia

In [24]:
wv_1=pd.read_csv("D:/3.2/Business Analytics/air/all years/wv-brooke.csv")
wv_2=pd.read_csv("D:/3.2/Business Analytics/air/all years/wv-marshall.csv")
wv_3=pd.read_csv("D:/3.2/Business Analytics/air/all years/wv-tucker.csv")
wv_4=pd.read_csv("D:/3.2/Business Analytics/air/all years/wv-wood.csv")

import Wyoming

In [25]:
wy_1=pd.read_csv("D:/3.2/Business Analytics/air/all years/wy-albany.csv")
wy_2=pd.read_csv("D:/3.2/Business Analytics/air/all years/wy-lincoln.csv")
wy_3=pd.read_csv("D:/3.2/Business Analytics/air/all years/wy-sublette.csv")
wy_4=pd.read_csv("D:/3.2/Business Analytics/air/all years/wy-teton.csv")

merge by state

In [149]:
cali=cali_1.iloc[:,[0,1]]

In [150]:
cali=pd.merge(cali_1,cali_2,how="outer",on="Date")

In [152]:
cali=cali.iloc[:,[0,1,6]]

In [153]:
cali=pd.merge(cali,cali_3,how="outer",on="Date")

In [154]:
cali=cali.iloc[:,[0,1,2,3]]

In [155]:
cali4=pd.merge(cali,cali_4,how="outer",on="Date")
cali4=cali4.iloc[:,[0,1,2,3,4]]

C:\Users\cyx\AppData\Local\Temp\ipykernel_16988\562702319.py:1: FutureWarning: Passing 'suffixes' which cause duplicate columns {' AQI Value_x'} in the result is deprecated and will raise a MergeError in a future version.
  cali4=pd.merge(cali,cali_4,how="outer",on="Date")

In [156]:
cali5=pd.merge(cali4,cali_5,how="outer",on="Date")
cali5=cali5.iloc[:,[0,1,2,3,4,5]]
cali6=pd.merge(cali5,cali_6,how="outer",on="Date")
cali6=cali6.iloc[:,[0,1,2,3,4,5,6]]
california=pd.merge(cali6,cali_7,how="outer",on="Date")
california=california.iloc[:,[0,1,2,3,4,5,6,7]]

C:\Users\cyx\AppData\Local\Temp\ipykernel_16988\3965609205.py:3: FutureWarning: Passing 'suffixes' which cause duplicate columns {' AQI Value_x'} in the result is deprecated and will raise a MergeError in a future version.
  cali6=pd.merge(cali5,cali_6,how="outer",on="Date")

In [157]:
california.columns=['Date','ca1','ca2','ca3','ca4','ca5','ca6','ca7']

In [158]:
california

            Date  ca1   ca2  ca3   ca4  ca5  ca6    ca7
0     01/01/2001  158  91.0  105  51.0  122  153  153.0
1     01/02/2001   66  42.0   49  38.0   42   96  140.0
2     01/03/2001  108  89.0   42  39.0   46   98  140.0
3     01/04/2001  111  51.0   62  38.0   63  111  107.0
4     01/05/2001  108  40.0   62  38.0   40  111  124.0
...          ...  ...   ...  ...   ...  ...  ...    ...
8030  12/27/2022   52  32.0  107  37.0   39   54   27.0
8031  12/28/2022   45  24.0   44  38.0   39   37   38.0
8032  12/29/2022   31  29.0   54  39.0   38   43   25.0
8033  12/30/2022   33  29.0   65  31.0   32   53   19.0
8034  12/31/2022   36  36.0   60  31.0   42   69   32.0

[8035 rows x 8 columns]

In [134]:
fl1=fl_1.iloc[:,[0,1]]
fl2=pd.merge(fl1,fl_2,how="outer",on="Date")
fl2=fl2.iloc[:,[0,1,2]]
fl3=pd.merge(fl2,fl_3,how="outer",on="Date")
fl3=fl3.iloc[:,[0,1,2,3]]
fl4=pd.merge(fl3,fl_4,how="outer",on="Date")
fl4=fl4.iloc[:,[0,1,2,3,4]]
florida=pd.merge(fl4,fl_5,how="outer",on="Date")
florida=florida.iloc[:,[0,1,2,3,4,5]]

C:\Users\cyx\AppData\Local\Temp\ipykernel_16988\3618522138.py:6: FutureWarning: Passing 'suffixes' which cause duplicate columns {' AQI Value_x'} in the result is deprecated and will raise a MergeError in a future version.
  fl4=pd.merge(fl3,fl_4,how="outer",on="Date")

In [135]:
florida.columns=['Date','fl1','fl2','fl3','fl4','fl5']

In [136]:
florida

            Date   fl1   fl2   fl3   fl4   fl5
0     01/01/2001  31.0  53.0  74.0  76.0  68.0
1     01/02/2001  27.0  36.0  73.0  26.0  42.0
2     01/03/2001  26.0  45.0  62.0  25.0  54.0
3     01/04/2001  35.0  51.0  66.0  53.0  64.0
4     01/05/2001  47.0  56.0  60.0  41.0  48.0
...          ...   ...   ...   ...   ...   ...
8030  07/21/2019   NaN  30.0  39.0  28.0  31.0
8031  07/30/2019   NaN  34.0  46.0  53.0  31.0
8032  01/16/2020   NaN  46.0  38.0  28.0  39.0
8033  01/17/2020   NaN  40.0  41.0  39.0  41.0
8034  03/15/2020   NaN  34.0  55.0  62.0  31.0

[8035 rows x 6 columns]

In [137]:
nd1=nd_1.iloc[:,[0,1]]
nd2=pd.merge(nd1,nd_2,how="outer",on="Date")
nd2=nd2.iloc[:,[0,1,2]]
n_dakota=pd.merge(nd2,nd_3,how="outer",on="Date")
n_dakota=n_dakota.iloc[:,[0,1,2,3]]

In [138]:
n_dakota.columns=['Date','nd1','nd2','nd3']

In [139]:
n_dakota

            Date   nd1   nd2   nd3
0     01/01/2001  30.0  53.0  29.0
1     01/02/2001  32.0  25.0  31.0
2     01/03/2001  32.0  33.0  31.0
3     01/04/2001  33.0  36.0  33.0
4     01/05/2001  32.0  31.0  30.0
...          ...   ...   ...   ...
8030  12/31/2017   NaN   NaN   7.0
8031  01/31/2018   NaN   NaN   4.0
8032  03/31/2018   NaN   NaN   2.0
8033  04/30/2018   NaN   NaN   4.0
8034  05/31/2018   NaN   NaN   8.0

[8035 rows x 4 columns]

In [140]:
ny1=ny_1.iloc[:,[0,1]]
ny2=pd.merge(ny1,ny_2,how="outer",on="Date")
ny2=ny2.iloc[:,[0,1,2]]
ny3=pd.merge(ny2,ny_3,how="outer",on="Date")
ny3=ny3.iloc[:,[0,1,2,3]]
ny4=pd.merge(ny3,ny_4,how="outer",on="Date")
ny4=ny4.iloc[:,[0,1,2,3,4]]
new_york=pd.merge(ny4,ny_5,how="outer",on="Date")
new_york=new_york.iloc[:,[0,1,2,3,4,5]]

C:\Users\cyx\AppData\Local\Temp\ipykernel_16988\571245152.py:6: FutureWarning: Passing 'suffixes' which cause duplicate columns {' AQI Value_x'} in the result is deprecated and will raise a MergeError in a future version.
  ny4=pd.merge(ny3,ny_4,how="outer",on="Date")

In [141]:
new_york.columns=['Date','ny1','ny2','ny3','ny4','ny5']

In [142]:
new_york

            Date   ny1    ny2    ny3    ny4    ny5
0     01/01/2001  42.0   37.0   38.0   38.0   30.0
1     01/02/2001  54.0   39.0   45.0   30.0   18.0
2     01/03/2001  70.0   31.0   58.0   44.0   15.0
3     01/04/2001  86.0   35.0   82.0   87.0   72.0
4     01/05/2001  86.0   23.0   74.0   48.0    3.0
...          ...   ...    ...    ...    ...    ...
8030  07/29/2001   NaN   50.0   39.0   38.0   44.0
8031  08/03/2001   NaN   71.0   62.0   50.0   58.0
8032  08/04/2001   NaN   97.0   70.0   44.0   31.0
8033  08/06/2001   NaN  105.0  101.0   93.0  164.0
8034  08/07/2001   NaN  156.0  192.0  213.0  202.0

[8035 rows x 6 columns]

Ohio

In [143]:
oh1=oh_1.iloc[:,[0,1]]
oh2=pd.merge(oh1,oh_2,how="outer",on="Date")
oh2=oh2.iloc[:,[0,1,2]]
oh3=pd.merge(oh2,oh_3,how="outer",on="Date")
oh3=oh3.iloc[:,[0,1,2,3]]
ohio=pd.merge(oh3,oh_4,how="outer",on="Date")
ohio=ohio.iloc[:,[0,1,2,3,4]]

ohio.columns=['Date','oh1','oh2','oh3','oh4']

ohio

C:\Users\cyx\AppData\Local\Temp\ipykernel_16988\1532155328.py:6: FutureWarning: Passing 'suffixes' which cause duplicate columns {' AQI Value_x'} in the result is deprecated and will raise a MergeError in a future version.
  ohio=pd.merge(oh3,oh_4,how="outer",on="Date")

            Date   oh1  oh2    oh3  oh4
0     01/01/2001  68.0   41  100.0   68
1     01/02/2001  77.0   62   72.0   68
2     01/03/2001  81.0   72   77.0   92
3     01/04/2001  73.0   67   77.0   89
4     01/05/2001  59.0   68   68.0   62
...          ...   ...  ...    ...  ...
8030  12/16/2016   NaN   45   34.0   38
8031  12/18/2016   NaN   35   29.0   32
8032  12/19/2016   NaN   45   45.0   61
8033  01/21/2017   NaN   51   25.0   63
8034  11/07/2019   NaN   36   51.0   43

[8035 rows x 5 columns]

Oklahoma

In [144]:
ok1=ok_1.iloc[:,[0,1]]
ok2=pd.merge(ok1,ok_2,how="outer",on="Date")
ok2=ok2.iloc[:,[0,1,2]]
oklahoma=pd.merge(ok2,ok_3,how="outer",on="Date")
oklahoma=oklahoma.iloc[:,[0,1,2,3]]

oklahoma.columns=['Date','ok1','ok2','ok3']

oklahoma

            Date   ok1   ok2   ok3
0     01/01/2001  30.0  44.0  61.0
1     01/02/2001  35.0  31.0   NaN
2     01/03/2001  38.0  25.0   NaN
3     01/04/2001  37.0  28.0   NaN
4     01/05/2001  42.0  28.0   NaN
...          ...   ...   ...   ...
8030  12/04/2021   NaN  57.0  61.0
8031  12/05/2021   NaN  53.0  47.0
8032  12/06/2021   NaN  32.0  31.0
8033  05/05/2022   NaN  32.0  31.0
8034  06/01/2022   NaN  38.0  38.0

[8035 rows x 4 columns]

Pennsylvania

In [148]:
penn1=penn_1.iloc[:,[0,1]]
penn2=pd.merge(penn1,penn_2,how="outer",on="Date")
penn2=penn2.iloc[:,[0,1,2]]
penn3=pd.merge(penn2,penn_3,how="outer",on="Date")
penn3=penn3.iloc[:,[0,1,2,3]]
penn4=pd.merge(penn3,penn_4,how="outer",on="Date")
penn4=penn4.iloc[:,[0,1,2,3,4]]
penn5=pd.merge(penn4,penn_5,how="outer",on="Date")
penn5=penn5.iloc[:,[0,1,2,3,4,5]]
pennsylvania=pd.merge(penn5,penn_6,how="outer",on="Date")
pennsylvania=pennsylvania.iloc[:,[0,1,2,3,4,5,6]]

pennsylvania.columns=['Date','penn1','penn2','penn3','penn4','penn5','penn6']

pennsylvania

C:\Users\cyx\AppData\Local\Temp\ipykernel_16988\1559039668.py:6: FutureWarning: Passing 'suffixes' which cause duplicate columns {' AQI Value_x'} in the result is deprecated and will raise a MergeError in a future version.
  penn4=pd.merge(penn3,penn_4,how="outer",on="Date")
C:\Users\cyx\AppData\Local\Temp\ipykernel_16988\1559039668.py:10: FutureWarning: Passing 'suffixes' which cause duplicate columns {' AQI Value_x'} in the result is deprecated and will raise a MergeError in a future version.
  pennsylvania=pd.merge(penn5,penn_6,how="outer",on="Date")

            Date  penn1  penn2  penn3  penn4  penn5  penn6
0     01/01/2001     33   25.0   38.0     50     63   37.0
1     01/02/2001     35   25.0   38.0     41     39   68.0
2     01/03/2001     38   54.0   57.0     73     53   65.0
3     01/04/2001     51   63.0   67.0     82     65   69.0
4     01/05/2001     61   85.0   44.0     95     56   29.0
...          ...    ...    ...    ...    ...    ...    ...
8030  12/27/2022     40   54.0   52.0     58     49   47.0
8031  12/28/2022     63   62.0   76.0     73     61   56.0
8032  12/29/2022     61   97.0   93.0     78     62   77.0
8033  12/30/2022     72  127.0  118.0    113     62   79.0
8034  12/31/2022     88   96.0  105.0     74     61   45.0

[8035 rows x 7 columns]

Texas

In [160]:
tx1=tx_1.iloc[:,[0,1]]
tx2=pd.merge(tx1,tx_2,how="outer",on="Date")
tx2=tx2.iloc[:,[0,1,2]]
tx3=pd.merge(tx2,tx_3,how="outer",on="Date")
tx3=tx3.iloc[:,[0,1,2,3]]
tx4=pd.merge(tx3,tx_4,how="outer",on="Date")
tx4=tx4.iloc[:,[0,1,2,3,4]]
tx5=pd.merge(tx4,tx_5,how="outer",on="Date")
tx5=tx5.iloc[:,[0,1,2,3,4,5]]
texas=pd.merge(tx5,tx_6,how="outer",on="Date")
texas=texas.iloc[:,[0,1,2,3,4,5,6]]

texas.columns=['Date','tx1','tx2','tx3','tx4','tx5','tx6']

texas

C:\Users\cyx\AppData\Local\Temp\ipykernel_16988\2777079985.py:6: FutureWarning: Passing 'suffixes' which cause duplicate columns {' AQI Value_x'} in the result is deprecated and will raise a MergeError in a future version.
  tx4=pd.merge(tx3,tx_4,how="outer",on="Date")
C:\Users\cyx\AppData\Local\Temp\ipykernel_16988\2777079985.py:10: FutureWarning: Passing 'suffixes' which cause duplicate columns {' AQI Value_x'} in the result is deprecated and will raise a MergeError in a future version.
  texas=pd.merge(tx5,tx_6,how="outer",on="Date")

            Date   tx1   tx2  tx3   tx4   tx5   tx6
0     01/01/2001  44.0  53.0   56  40.0  53.0  23.0
1     01/02/2001  24.0  19.0   61  26.0  24.0  25.0
2     01/03/2001  22.0  19.0   81  36.0  29.0  29.0
3     01/04/2001  59.0  36.0   64  57.0  39.0  29.0
4     01/05/2001  37.0  23.0   51  33.0  34.0  29.0
...          ...   ...   ...  ...   ...   ...   ...
8030  08/28/2017   NaN  33.0   50   NaN   NaN  35.0
8031  08/29/2017   NaN  48.0   52   NaN   NaN  44.0
8032  08/30/2017   NaN  48.0   51   NaN   NaN  45.0
8033  08/31/2017   NaN  41.0   52   NaN  43.0  46.0
8034  08/25/2020   NaN  47.0   49   9.0  45.0   NaN

[8035 rows x 7 columns]

West Virginia

In [161]:
wv1=wv_1.iloc[:,[0,1]]
wv2=pd.merge(wv1,wv_2,how="outer",on="Date")
wv2=wv2.iloc[:,[0,1,2]]
wv3=pd.merge(wv2,wv_3,how="outer",on="Date")
wv3=wv3.iloc[:,[0,1,2,3]]
w_virginia=pd.merge(wv3,wv_4,how="outer",on="Date")
w_virginia=w_virginia.iloc[:,[0,1,2,3,4]]

w_virginia.columns=['Date','wv1','wv2','wv3','wv4']

w_virginia

C:\Users\cyx\AppData\Local\Temp\ipykernel_16988\3124446366.py:6: FutureWarning: Passing 'suffixes' which cause duplicate columns {' AQI Value_x'} in the result is deprecated and will raise a MergeError in a future version.
  w_virginia=pd.merge(wv3,wv_4,how="outer",on="Date")

            Date   wv1   wv2   wv3   wv4
0     01/01/2001  55.0  67.0  34.0  77.0
1     01/02/2001  12.0   NaN  28.0   NaN
2     01/03/2001  15.0   NaN  31.0   NaN
3     01/04/2001  59.0  57.0  39.0  56.0
4     01/05/2001  14.0   NaN  26.0   NaN
...          ...   ...   ...   ...   ...
8030  01/13/2019   NaN   NaN  31.0   NaN
8031  01/14/2019   NaN   NaN  23.0   NaN
8032  04/23/2019   NaN   NaN  48.0  43.0
8033  11/17/2022   NaN   NaN  27.0   NaN
8034  11/18/2022   NaN   NaN  28.0   NaN

[8035 rows x 5 columns]

Wyoming

In [162]:
wy1=wy_1.iloc[:,[0,1]]
wy2=pd.merge(wy1,wy_2,how="outer",on="Date")
wy2=wy2.iloc[:,[0,1,2]]
wy3=pd.merge(wy2,wy_3,how="outer",on="Date")
wy3=wy3.iloc[:,[0,1,2,3]]
wyoming=pd.merge(wy3,wy_4,how="outer",on="Date")
wyoming=wyoming.iloc[:,[0,1,2,3,4]]

wyoming.columns=['Date','wy1','wy2','wy3','wy4']

wyoming

C:\Users\cyx\AppData\Local\Temp\ipykernel_16988\1829721964.py:6: FutureWarning: Passing 'suffixes' which cause duplicate columns {' AQI Value_x'} in the result is deprecated and will raise a MergeError in a future version.
  wyoming=pd.merge(wy3,wy_4,how="outer",on="Date")

            Date   wy1   wy2   wy3   wy4
0     01/01/2001  61.0   9.0  45.0  39.0
1     01/02/2001  45.0  13.0  44.0  42.0
2     01/03/2001  44.0  35.0  44.0  42.0
3     01/04/2001  47.0  42.0  44.0  44.0
4     01/05/2001  45.0  36.0  42.0  43.0
...          ...   ...   ...   ...   ...
8030  05/19/2007   NaN  24.0  74.0  74.0
8031  05/20/2007   NaN  28.0  77.0  49.0
8032  05/21/2007   NaN  19.0  46.0  47.0
8033  12/19/2012   NaN  12.0  39.0  37.0
8034  11/17/2013   NaN  14.0  41.0  39.0

[8035 rows x 5 columns]

In [165]:
california.to_csv('california_raw.csv',encoding='utf-8', index=False)
florida.to_csv('florida_raw.csv',encoding='utf-8', index=False)
n_dakota.to_csv('n_dakota_raw.csv',encoding='utf-8', index=False)
new_york.to_csv('new_york_raw.csv',encoding='utf-8', index=False)
ohio.to_csv('ohio_raw.csv',encoding='utf-8', index=False)
oklahoma.to_csv('oklahoma_raw.csv',encoding='utf-8', index=False)
pennsylvania.to_csv('pennsylvania_raw.csv',encoding='utf-8', index=False)
texas.to_csv('texas_raw.csv',encoding='utf-8', index=False)
w_virginia.to_csv('w_virginia_raw.csv',encoding='utf-8', index=False)
wyoming.to_csv('wyoming_raw.csv',encoding='utf-8', index=False)

In [ ]:
import pandas as pd
import numpy as np

fillna

def fill_nans_row_avg_for_state(state_csv_file_name):
    state_daily_aqi_df = pd.read_csv(state_csv_file_name)
  
  # convert all columns except the first to floats
    state_daily_aqi_df.iloc[:, 1:] = state_daily_aqi_df.iloc[:, 1:].astype(float)

  # fill NaNs in each row with the row average (excluding the first column)
    row_means = state_daily_aqi_df.iloc[:, 1:].mean(axis=1)
    state_daily_aqi_df.iloc[:, 1:] = state_daily_aqi_df.iloc[:, 1:].apply(lambda x: x.fillna(row_means))
 
    row_means_after = pd.DataFrame(state_daily_aqi_df.iloc[:, 1:].mean(axis=1))
    state_daily_aqi_df["average"]=row_means_after
    
    return state_daily_aqi_df

california_filled = fill_nans_row_avg_for_state("C:/Users/cyx/Desktop/merged data(to be filled)/raw data by state/california_raw.csv")
texas_filled = fill_nans_row_avg_for_state("C:/Users/cyx/Desktop/merged data(to be filled)/raw data by state/texas_raw.csv")
n_dakota_filled = fill_nans_row_avg_for_state("C:/Users/cyx/Desktop/merged data(to be filled)/raw data by state/n_dakota_raw.csv")
wyoming_filled = fill_nans_row_avg_for_state("C:/Users/cyx/Desktop/merged data(to be filled)/raw data by state/wyoming_raw.csv")
pennsylvania_filled = fill_nans_row_avg_for_state("C:/Users/cyx/Desktop/merged data(to be filled)/raw data by state/pennsylvania_raw.csv")
w_virginia_filled = fill_nans_row_avg_for_state("C:/Users/cyx/Desktop/merged data(to be filled)/raw data by state/w_virginia_raw.csv")
oklahoma_filled = fill_nans_row_avg_for_state("C:/Users/cyx/Desktop/merged data(to be filled)/raw data by state/oklahoma_raw.csv")
new_york_filled = fill_nans_row_avg_for_state("C:/Users/cyx/Desktop/merged data(to be filled)/raw data by state/new_york_raw.csv")
ohio_filled = fill_nans_row_avg_for_state("C:/Users/cyx/Desktop/merged data(to be filled)/raw data by state/ohio_raw.csv")
florida_filled = fill_nans_row_avg_for_state("C:/Users/cyx/Desktop/merged data(to be filled)/raw data by state/florida_raw.csv")

california_av=california_filled[['Date','average']]
texas_av=texas_filled[['Date','average']]
wyoming_av=wyoming_filled[['Date','average']]
oklahoma_av=oklahoma_filled[['Date','average']]
ohio_av=ohio_filled[['Date','average']]
w_virginia_av=w_virginia_filled[['Date','average']]
florida_av=florida_filled[['Date','average']]
new_york_av=new_york_filled[['Date','average']]
n_dakota_av=n_dakota_filled[['Date','average']]
pennsylvania_av=pennsylvania_filled[['Date','average']]

Merge all states by date

df2=pd.merge(california_av,texas_av,how="outer",on="Date")
df3=pd.merge(df2,n_dakota_av,how="outer",on="Date")
df4=pd.merge(df3,wyoming_av,how="outer",on="Date")
df5=pd.merge(df4,pennsylvania_av,how="outer",on="Date")
df6=pd.merge(df5,w_virginia_av,how="outer",on="Date")
df7=pd.merge(df6,oklahoma_av,how="outer",on="Date")
df8=pd.merge(df7,florida_av,how="outer",on="Date")
df9=pd.merge(df8,new_york_av,how="outer",on="Date")
df10=pd.merge(df9,ohio_av,how="outer",on="Date")

df10.columns=['Date','california','texas','n_dakota','wyoming','pennsylvania','w_virginia','oklahoma','florida','new_york','ohio']

df10

df10.dtypes
#type of date is object

df10["date2"]=pd.to_datetime(df10['Date'],format='%m/%d/%Y')

california=df10.california
texas=df10.texas
n_dakota=df10.n_dakota
wyoming=df10.wyoming
pennsylvania=df10.pennsylvania
w_virginia=df10.w_virginia
oklahoma=df10.oklahoma
florida=df10.florida
new_york=df10.new_york
ohio=df10.ohio

import numpy as np

california.index=df10['date2']
texas.index=df10['date2']
n_dakota.index=df10['date2']
wyoming.index=df10['date2']
pennsylvania.index=df10['date2']
w_virginia.index=df10['date2']
oklahoma.index=df10['date2']
florida.index=df10['date2']
new_york.index=df10['date2']
ohio.index=df10['date2']

california_month=california.resample('m').mean()
texas_month=texas.resample('m').mean()
n_dakota_month=n_dakota.resample('m').mean()
wyoming_month=wyoming.resample('m').mean()
pennsylvania_month=pennsylvania.resample('m').mean()
w_virginia_month=w_virginia.resample('m').mean()
oklahoma_month=oklahoma.resample('m').mean()
florida_month=florida.resample('m').mean()
new_york_month=new_york.resample('m').mean()
ohio_month=ohio.resample('m').mean()

d2=pd.merge(california_month,texas_month,how="outer",on='date2')
d3=pd.merge(d2,n_dakota_month,how="outer",on="date2")
d4=pd.merge(d3,wyoming_month,how="outer",on="date2")
d5=pd.merge(d4,pennsylvania_month,how="outer",on="date2")
d6=pd.merge(d5,w_virginia_month,how="outer",on="date2")
d7=pd.merge(d6,oklahoma_month,how="outer",on="date2")
d8=pd.merge(d7,florida_month,how="outer",on="date2")
d9=pd.merge(d8,new_york_month,how="outer",on="date2")
d10=pd.merge(d9,ohio_month,how="outer",on="date2")

d10

d10.to_csv('air_monthly.csv',encoding='utf-8', index=True)